Revit 2027 API
SchemaBuilder.GUIDIsValid Method
 Checks whether the supplied GUID value is valid.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool GUIDIsValid(
	Guid guid
)
Public Shared Function GUIDIsValid (
	guid As Guid
) As Boolean
public:
static bool GUIDIsValid(
	Guid guid
)
static member GUIDIsValid :
        guid : Guid -> bool
Parameters
guid Guid
 The GUID to check
Return Value
Boolean
 True if the GUID is valid
See Also
Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace